# Copyright © 2022 mightyK1ngRichard <dimapermyakov55@gmail.com>

import json

TIME_TABLE = {
    "числитель": {
        "Понедельник": [
            'Самостоятельная работа',
        ],
        "Вторник": [
            '1. Экология (сем) - 732л',
            '2. ТВиМС (сем) - 830л',
            '3. Электротехника (сем) - 529л',
            '4. ТВиМС (лек) - 224л'
        ],
        "Среда": [
            'Модели данных (лек) - 501ю',
            'Физика (лек) - 501ю',
            'Модели данных (лаб) - 306.2э',
            'Модели данных (лаб) - 306.2э'
        ],
        "Четверг": [
            '1. Физра - каф. ФВ',
            '2. Физика(сем) - 259л',
            '3. Иностранный язык (сем) - каф. Л2'
        ],
        "Пятница": [
            '1. Электротехника (лек) - 501ю',
            '2. АСОИУ (лек) - 501ю',
            '3. Электроника (лаб) - 215м',
            '4. Электроника (лаб) - 215м'
        ],
        "Суббота": [
            '1. Правоведение (лек) - 224л',
            '2. ТВиМС (лек) - 224л',
            '3. Физра - каф. ФВ'
        ],
        "Воскресенье": [
            'Самостоятельная работа.'
        ]
    },
    "знаменатель": {
        "Понедельник": [
            'Самостоятельная работа',
        ],
        "Вторник": [
            '1. ТВиМС (сем) - 830л',
            '2. Правоведение (сем) - 615л',
            '3. Экология (лек) - 224л'
        ],
        "Среда": [
            '1. Модели данных (лек) - 501ю',
            '2. Физика (лек) - 501ю',
            '3. Физика (лаб) - каф. ФН4',
            '4. Физика (лаб) - каф. ФН4'
        ],
        "Четверг": [
            '1. Физра - каф. ФВ',
            '2. Базовые компоненты интернет технологий (лек) - 224л',
            '3. Иностранный язык (сем) - каф. Л2'
            '3. Базовые компоненты интернет технологий (сем) - 306.2э'
        ],
        "Пятница": [
            '1. Электротехника (лек) - 501ю',
            '2. АСОИУ (лек) - 501ю'
        ],
        "Суббота": [
            '1. Правоведение (лек) - 224л',
            '2. ТВиМС (лек) - 224л',
            '3. Физра - каф. ФВ'
        ],
        "Воскресенье": [
            'Самостоятельная работа.'
        ]
    }
}


class User:
    def __init__(self, id_user: int, name: str, age: int, phone_number: str):
        self.id_user = id_user
        self.name = name
        self.age = age
        self.phone_number = phone_number


def add_user() -> dict:
    data = User(2, input('имя: '), int(input('возраст: ')), input('телефон: '))
    res = dict()
    res[data.id_user] = {'name': data.name, 'age': data.age, 'phone_number': data.phone_number}
    return res


def main():
    with open("data.json", "a") as write_file:
        json.dump(add_user(), write_file)


if __name__ == '__main__':
    main()
